In [1]:
#import libaries
import numpy as np
import pandas as pd
import matplotlib as plt

In [2]:
#import dataset
customer = pd.read_csv('Customer.csv')
genre = pd.read_csv('Genre.csv')
invoice = pd.read_csv('Invoice.csv')
invoiceline = pd.read_csv('InvoiceLine.csv')
mediatype = pd.read_csv('MediaType.csv')
playlist = pd.read_csv('Playlist.csv')
playlisttrack = pd.read_csv('PlaylistTrack.csv')
track = pd.read_csv('Track.csv')

In [3]:
#view the head of the datasets

In [4]:
customer.head(1)

,CustomerId,FirstName,LastName,Company,Address,City,State,Country,PostalCode,Phone,Fax,Email,SupportRepId
0,1,Luís,Gonçalves,Embraer - Empresa Brasileira de Aeronáutica S.A.,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,+55 (12) 3923-5555,+55 (12) 3923-5566,luisg@embraer.com.br,3

In [5]:
genre.head(1)

   GenreId  Name
0        1  Rock

In [6]:
invoice.head(1)

,InvoiceId,CustomerId,InvoiceDate,BillingAddress,BillingCity,BillingState,BillingCountry,BillingPostalCode,Total
0,1,2,NaN,Theodor-Heuss-Straße 34,Stuttgart,NaN,Germany,70174,1.98

In [7]:
invoiceline.head(1)

   InvoiceLineId  InvoiceId  TrackId  UnitPrice  Quantity
0              1          1        2       0.99         1

In [8]:
track.head(1)

,TrackId,Name,AlbumId,MediaTypeId,GenreId,Composer,Milliseconds,Bytes,UnitPrice
0,1,For Those About To Rock (We Salute You),1,1,1,"Angus Young, Malcolm Young, Brian Johnson",343719,11170334,0.99

QUESTION 1

In [9]:
#using groupby method to determine the city with the highest sum ofinvoice with the total 
invoice.groupby('BillingCity')['Total'].sum().sort_values(ascending=False).head(1)

BillingCity
Prague    90.24
Name: Total, dtype: float64

QUESTION 2

In [10]:
#using groupby method to determine the country that have the most invoice 
invoice.groupby('BillingCountry')['Total'].count().sort_values(ascending=False).head()

BillingCountry
USA        91
Canada     56
Brazil     35
France     35
Germany    28
Name: Total, dtype: int64

QUESTION 3

In [11]:
#joing the custormer and invoice datast together
customer_and_invoice = pd.merge(customer,invoice)

In [12]:
customer_and_invoice.head(2)

,CustomerId,FirstName,LastName,Company,Address,City,State,Country,PostalCode,Phone,...,Email,SupportRepId,InvoiceId,InvoiceDate,BillingAddress,BillingCity,BillingState,BillingCountry,BillingPostalCode,Total
0,1,Luís,Gonçalves,Embraer - Empresa Brasileira de Aeronáutica S.A.,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,+55 (12) 3923-5555,...,luisg@embraer.com.br,3,98,NaN,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,3.98
1,1,Luís,Gonçalves,Embraer - Empresa Brasileira de Aeronáutica S.A.,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,+55 (12) 3923-5555,...,luisg@embraer.com.br,3,121,NaN,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,3.96

In [13]:
#using groupby method to determine the customer who has spent the most money
customer_and_invoice.groupby('LastName')['Total'].sum().sort_values(ascending=False).head(1)

LastName
Holý    49.62
Name: Total, dtype: float64

QUESTION 4

In [14]:
#renaming a column in the genre dataset
genre.rename(columns={'Name':'genrename'}, inplace=True)

In [15]:
genre.head(1)

   GenreId genrename
0        1      Rock

In [16]:
#joing the track and genre dataset together and saving as track_and_genre
track_and_genre = pd.merge(track,genre)

In [17]:
track_and_genre.head(3)

,TrackId,Name,AlbumId,MediaTypeId,GenreId,Composer,Milliseconds,Bytes,UnitPrice,genrename
0,1,For Those About To Rock (We Salute You),1,1,1,"Angus Young, Malcolm Young, Brian Johnson",343719,11170334,0.99,Rock
1,2,Balls to the Wall,2,2,1,NaN,342562,5510424,0.99,Rock
2,3,Fast As a Shark,3,2,1,"F. Baltes, S. Kaufman, U. Dirkscneider & W. Ho...",230619,3990994,0.99,Rock

In [18]:
#joining the invoice and invoiceline dataset together and saving it as invoiceline_and_invoice
invoiceline_and_invoice = pd.merge(invoiceline,invoice)

In [19]:
invoiceline_and_invoice .head(1)

,InvoiceLineId,InvoiceId,TrackId,UnitPrice,Quantity,CustomerId,InvoiceDate,BillingAddress,BillingCity,BillingState,BillingCountry,BillingPostalCode,Total
0,1,1,2,0.99,1,2,NaN,Theodor-Heuss-Straße 34,Stuttgart,NaN,Germany,70174,1.98

In [20]:
#joining the track_and_genre  and  invoiceline_and_invoice dataset together and saving it as new
new = pd.merge(track_and_genre,invoiceline_and_invoice )

In [21]:
new.head(1)

,TrackId,Name,AlbumId,MediaTypeId,GenreId,Composer,Milliseconds,Bytes,UnitPrice,genrename,...,InvoiceId,Quantity,CustomerId,InvoiceDate,BillingAddress,BillingCity,BillingState,BillingCountry,BillingPostalCode,Total
0,1,For Those About To Rock (We Salute You),1,1,1,"Angus Young, Malcolm Young, Brian Johnson",343719,11170334,0.99,Rock,...,108,1,47,NaN,"Via Degli Scipioni, 43",Rome,RM,Italy,00192,5.94

In [22]:
#joing the new and customer dataset together and saving it as new-data
new_data = pd.merge(new,customer)

In [23]:
new_data.head(1)

,TrackId,Name,AlbumId,MediaTypeId,GenreId,Composer,Milliseconds,Bytes,UnitPrice,genrename,...,Company,Address,City,State,Country,PostalCode,Phone,Fax,Email,SupportRepId
0,1,For Those About To Rock (We Salute You),1,1,1,"Angus Young, Malcolm Young, Brian Johnson",343719,11170334,0.99,Rock,...,NaN,"Via Degli Scipioni, 43",Rome,RM,Italy,00192,+39 06 39733434,NaN,lucas.mancini@yahoo.it,5

In [24]:
#dropping duplicate rows in the new-data dataset
new_data_copy = new_data.drop_duplicates(subset='Email', keep='first', inplace=False)

In [25]:
#a query to return the Email,FirstName,LastName and genre of all rock music listeneers
rock_listeners = new_data_copy.loc[(new_data['genrename']=='Rock'),['Email','FirstName','LastName','genrename']]

In [26]:
#using the sort-values function to return thethe list of rock music listeners in alphabatical order y their email
rock_listeners.sort_values(['Email'], ascending = True).head(3)

                       Email  FirstName  LastName genrename
2164  aaronmitchell@yahoo.ca      Aaron  Mitchell      Rock
836         alero@uol.com.br  Alexandre     Rocha      Rock
1822  astrid.gruber@apple.at     Astrid    Gruber      Rock

QUESTION 5

In [27]:
spent = pd.DataFrame(new_data.groupby(['BillingCountry', "genrename"], as_index=False)['UnitPrice'].sum())
spent.head()

  BillingCountry           genrename  UnitPrice
0      Argentina  Alternative & Punk       8.91
1      Argentina      Easy Listening       1.98
2      Argentina                Jazz       1.98
3      Argentina               Latin       7.92
4      Argentina               Metal       6.93

In [28]:
spent_in_total = pd.DataFrame(spent.groupby('BillingCountry', as_index=False)['UnitPrice'].max())
spent_in_total.head()

  BillingCountry  UnitPrice
0      Argentina       8.91
1      Australia      21.78
2        Austria      14.85
3        Belgium      20.79
4         Brazil      80.19

In [29]:
pd.merge(spent_in_total, spent, on = ['UnitPrice', 'BillingCountry'], how = 'inner').head()

  BillingCountry  UnitPrice           genrename
0      Argentina       8.91  Alternative & Punk
1      Argentina       8.91                Rock
2      Australia      21.78                Rock
3        Austria      14.85                Rock
4        Belgium      20.79                Rock